export interface Project {
  id: number;
  name: string;
  role: string;
  period: string;
  description: string;
  color: string;
  tags: string[];
}

export const projects: Project[] = [
  {
    id: 0,
    name: "中化能源物流港",
    role: "技术经理",
    period: "2020.10 - 2023.06",
    description:
      "中化能源物流港平台主要结合了公司的 qPaaS 工业数字化平台和低代码平台实现了中化各港口的商流、物流、信息流、资金流等的系统平台快速搭建和业务数据融会贯通。打造了石化物流行业“智改数转”标杆案例，以石化物流的“智变”驱动行业高质量发展新引擎。",
    color: "#00FF41",
    tags: ["Vue", "React", "低代码平台", "工业数字化"],
  },
  {
    id: 1,
    name: "新能源电动车大数据采集系统",
    role: "前端开发",
    period: "2019.10 - 2020.10",
    description:
      "新能源电动车大数据采集与分析系统主要功能体现在对新能源汽车进行全方位的数据采集和上传、以图标和地图的方式对车辆进行远程监测并实时反馈，及时上报车辆的异常和告警信息。并与APP相结合，在对数据和车辆行为进行分析后及时给出车辆预警信息，保障车辆的驾驶安全和全面监测。",
    color: "#FF006E",
    tags: ["Vue", "数据可视化", "地图", "移动端"],
  },
  {
    id: 2,
    name: "御捷智行小程序",
    role: "小程序开发",
    period: "2019.07 - 2020.10",
    description:
      "御捷智行小程序与新能源电动车大数据采集系统与分析服务平台相关联。手机端对车辆状态、剩余电流、当前温度、里程、胎压进行监测并可以对车辆进行远程遥控（开锁、关锁、升降窗、开关灯、寻车等功能）和健康体检;同时还提供了对车辆地图定位、轨迹查询、电子围栏、车辆信息修改、用户设置和商城等功能。",
    color: "#00D9FF",
    tags: ["微信小程序", "物联网", "地图", "蓝牙"],
  },
  {
    id: 3,
    name: "智能安防社区",
    role: "前端开发",
    period: "2018.03 - 2019.04",
    description:
      "东方网力智能安防社区系统解决方案聚焦社区场景，整合社区内视频监控、人脸抓拍、卡口过车、门禁等多类动态感知数据，围绕人、车、房屋等要素，实现辖区内实有人口、实有房屋、实有单位等基础数据采集和汇聚，为公安、综治等部门提供社区实有人口管理、车辆管控以及潜在风险预控等业务应用。",
    color: "#9B59B6",
    tags: ["Angular", "Vue", "安防", "大数据"],
  },
];
